# 판다스(Pandas)

- 데이터 처리를 위해 존재하는 가장 인기 있는 라이브러리
- 행과 열로 이뤄진 2차원 데이터를 효율적으로 가공/처리할 수 있는 다양하고 훌륭한 기능을 제공. 넘파이보다 훨씬 유연하고 편리하게 데이터 핸들링 가능
- 파이썬의 리스트, 컬렉션, 넘파이 등의 내부 데이터뿐만 아니라 CSV 등의 파일을 쉽게 DataFrame으로 변경해 데이터의 가공/분석을 편리하게 수행할 수 있게 만들어준다.

- Index는 개별 데이터를 고유하게 식별하는 Key 값
- **Series와 DataFrame** 모두 Index를 key 값으로 가지고 있으나 **Series는 칼럼이 하나뿐인 데이터 구조체이고, df는 칼럼이 여러 개인 데이터 구조체!**

## 판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API

In [79]:
import pandas as pd

- **read.csv()** : CSV(칼럼을 ','로 구분한 파일 포맷) 파일 포맷 변환을 위한 API (어떤 필드 구분 문자 기반의 파일 포맷도 DataFrame으로 변환 가능
- **read.csv() vs read.table()** -> 가장 큰 차이는 필드 구분 문자가 콤마(',')냐, 탭('₩t')이냐의 차이
- **read.fwf()** : Fixed Width, 즉 고정 길이 기반의 칼럼 포맷을 DataFrame으로 로딩하기 위한 API

- + **DataFrame.head(N)** : df의 맨 앞에 있는 N개의 로우 반환 (Default는 5개)
- + **DataFrame.shape** : df의 행과 열을 튜플 형태로 반환
- + **DataFrame.info()** : 총 데이터 건수와 데이터 타입, Null 건수를 알 수 있다.
- + **DataFrame.describe()** : 칼럼별 숫자형 데이터값의 n-percentile 분포도, 평균값, 최댓값, 최솟값을 나타낸다. 오직 숫자형(int,float 등) 칼럼의 분포도만 조사. 개략적인 데이터 분포도만 확인할 수 있다.
- + **value_counts()** : 해당 칼럼값의 유형과 건수를 확인할 수 있다. 지정된 칼럼의 데이터값 건수를 반환. 데이터 분포도 확인에 매우 유용한 함수.
- + **pd.DataFrame(생성 인자 data, 생성 인자 columns)** : 생성 인자 data는 리스트나 딕셔너리 또는 넘파이 ndarray를 입력받고, 생성 인자 columns는 칼럼명 리스트를 입력받아 df 생성

In [6]:
titanic_df = pd.read_csv(r'C:/Users/User/titanic_train.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [80]:
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type:', type(titanic_df))
titanic_df

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0              1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1              2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2              3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3              4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S
4              5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S
..           ...       ...     ...             ...     ...   ...    ...    ...             ...      ...   ...      ...
886          887         0       2  Montvila, R...    male  27.0      0      0          211536  13.0000   NaN        S
887          888         1       1  Graham, Mis...  female  19.0      0      0          112053  30.0000   B42        S
888          889         0       3  Johnston, M...  female   NaN      1      2      W./C. 6607  23.4500   NaN        S
889          890         1       1  Behr, Mr. K...    male  26.0      0      0          111369  30.0000  C148        C
890          891         0       3  Dooley, Mr....    male  32.0      0      0          370376   7.7500   NaN        Q

[891 rows x 12 columns]

- pd.read_csv()는 호출 시 파일명 인자로 들어온 파일을 DataFrame 객체로 반환
- 별다른 매개변수 지정이 없으면 파일의 맨 처음 로우를 칼럼명으로 인지하고 칼럼명으로 변환, 콤마로 분리된 데이터 값들이 해당 칼럼에 맞게 할당
- 위 결과에서 첫번째 열을 보면 파일에 기재되지 않은 데이터값이 로우 순으로 0, 1, 2, ... 과 같이 순차적으로 표시 -> **판다스의 Index 객체 값**
- 모든 df 내의 데이터는 생성되는 순간 고유의 Index 값을 가짐

In [7]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [81]:
print('DataFrame 크기:', titanic_df.shape)

DataFrame 크기: (891, 12)

- DataFrame 객체는 데이터 뿐만 아니라 칼럼의 타입, Null 데이터 개수, 데이터 분포도 등의 메타 데이터도 조회가 가능하다.

In [9]:
# DataFrame의 총 데이터 건수와 데이터 타입, Null 건수를 표현
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [82]:
titanic_df.describe()

       PassengerId    Survived      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- count : Not Null인 데이터 건수
- mean : 전체 데이터의 평균값
- std : 표준편차
- min : 최솟값
- max : 최댓값
- 25% : 25 percentile 값
- 50% : 50 percentile 값
- 75% : 75 percentile 값

- **describe() 해당 숫자 칼럼이 숫자형 카테고리 칼럼인지를 파악할 수 있게 도와준다.**
- 카테고리 칼럼은 특정 범주에 속하는 값을 코드화한 칼럼 (ex. 성별 칼럼 : 남 -> 1, 여 -> 2로 표현)

In [83]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

- value_counts()는 많은 건수 순서로 정렬되어 값을 반환
- df의 [ ] 연산자 내부에 칼럼명을 입력하면 해당 칼럼에 해당하는 **Series** 객체를 반환

In [84]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

- Series는 Index와 단 하나의 column으로 구성된 데이터 세트

In [86]:
titanic_pclass.head() # head()를 이용해 앞의 5개 데이터만 추출
# 좌 : Series의 Index 우: Series의 데이터 값

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

- 단일 column으로 되어 있는 Series 객체에서 value_counts()를 호출하는 것이 column별 데이터 값의 분포도를 더 명시적으로 파악하기 쉬움

In [87]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
Pclass
3    491
1    216
2    184
Name: count, dtype: int64

- **인덱스**가 단순히 0부터 시작하는 순차 값과 같은 의미 없는 식별자만 할당하는 것이 아니라 **고유성이 보장된다면 의미 있는 데이터값 할당**도 가능
=> value_counts()는 칼럼 값별 데이터 건수를 반환하므로 고유 칼럼 값을 식별자로 사용 가능!

- 인덱스는 숫자형뿐만 아니라 문자열도 가능. 단, 모든 인덱스의 고유성이 보장돼야 함

### 주의 : value_counts() 메서드를 사용할 때 Null 값을 무시하고 결괏값을 내놓기 쉬움

- value_coutns() 는 Null 값을 포함하여 개별 데이터 값의 건수를 계산할지를 **dropna 인자**로 판단
- + dropna의 **기본값은 True**이며 **Null 값을 무시**하고 개별 데이터 값의 건수를 계산
- + Null 값 포함하여 value_counts() 적용하고자 한다면 dropna 인자값을 False로 입력해 주면 됨

In [88]:
print('titanic_df 데이터 건수:', titanic_df.shape[0])
print('기본 설정인 dropna=True로 value_counts()')
# value_counts()는 디폴트로 dropna=True이므로 value_counts(dropna=True)와 동일.
print(titanic_df['Embarked'].value_counts())
print(titanic_df['Embarked'].value_counts(dropna=False))

titanic_df 데이터 건수: 891
기본 설정인 dropna=True로 value_counts()
Embarked
S    644
C    168
Q     77
Name: count, dtype: int64
Embarked
S      644
C      168
Q       77
NaN      2
Name: count, dtype: int64

### DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환

- DataFrame은 csv 파일에 대해 read_csv()를 사용 또는 리스트, 딕셔너리, 넘파이 ndarray 등 다양한 데이터로부터 생성될 수 있다.
- 반대로 DataFrame은 리스트, 딕셔너리, 넘파이 ndarray로도 변환이 가능하다.

### 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

- DataFrame은 리스트, 넘파이 ndarray와 다르게 칼럼명을 가지고 있어 데이터 핸들링이 용이
- + 칼럼명을 리스트로 입력받아서 사용 가능 (미지정 시 자동으로 칼럼명 할당

#### 1차원 형태의 리스트와 넘파이 ndarray를 DataFrame으로 변환

In [16]:
import numpy as np

col_name1 = ['col1']
list1 = [1,2,3]
array1 = np.array(list1)
print('array1 shape:', array1.shape)

# 리스트를 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)

# 넘파이 ndarray를 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

array1 shape: (3,)
1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [89]:
# 3개의 칼럼명이 필요함.
col_name2 = ['col1','col2','col3']

# 2행x3행 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환.
list2 = [[1,2,3],
         [11,12,13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape)
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)
df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array2)

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

#### 딕셔너리를 DataFrame으로 변환
- **딕셔너리의 키(Key)는 칼럼명으로, 딕셔너리의 값(Value)은 키에 해당하는 칼럼 데이터로 변환됨** => 따라서 키는 문자열, 값은 리스트(또는 ndarray) 형태로 딕셔너리를 구성

In [90]:
# Key는 문자열 칼럼명으로 매핑, Value는 리스트 형(또는 ndarray) 칼럼 데이터로 매핑
dict = {'col1':[1,11], 'col2':[2,22], 'col3':[3,33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

### DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

- DataFrame 객체의 values를 이용해 쉽게 변환 가능

#### DataFrame 객체를 ndarray로 변환

In [91]:
# DataFrame을 ndarray로 변환
array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

#### DataFrame을 리스트와 딕셔너리로 변환

- 리스트로의 변환은 values로 얻은 ndarray에 tolist()를 호출하면 된다.
- 딕셔너리로의 변환은 DataFrame 객체의 to_dict() 메서드를 호출하는데, 인자로 'list'를 입력하면 딕셔너리의 값이 리스트형으로 반환된다.

In [92]:
# DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

# DataFrame을 딕셔너리로 변환
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### DataFrame의 칼럼 데이터 세트 생성과 수정

- DataFrame의 칼럼 데이터 세트 생성과 수정 역시 [ ] 연산자를 이용해 쉽게 할 수 있다.
- DataFrame [ ] 내에 새로운 칼럼명 입력하고 값을 할당. Series에 상숫값 할당 시 Series의 모든 데이터 세트에 일괄적으로 적용

In [98]:
titanic_df['Age_0'] = 0
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No  Age_0
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      220.0          2      0
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      380.0          2      0
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      260.0          1      0

In [97]:
# 기존 칼럼 series를 가공해 새로운 칼럼 series를 DataFrame에 추가
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      220.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      380.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      260.0          1

- DataFrame 내의 기존 칼럼 값도 쉽게 일괄적으로 업데이트 가능

In [95]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      360.0          1

### DataFrame 데이터 삭제

- **DataFrame.drop()** : DataFrame에서 데이터 삭제
- drop() 메서드의 원형 : DataFrame.drop(**labels=None**, **axis=0**, index=None, columns=None, level=None, **inplace=False**, errors='raise')
- **axis 값에 따라서 특정 칼럼, 또는 행을 드롭한다.** (ex. axis=0(로우(행)) : 로우 축 방향으로 드롭을 수행)
- labels에 원하는 칼럼명을 입력하고 axis=1(칼럼(열))을 입력시 지정된 칼럼 드랍 => 따라서 axis=0으로 지정시 DataFrame은 자동으로 labels에 오는 값을 인덱스로 간주 (1열)
- 대부분 drop() 메서드가 사용되는 대부분의 경우는 (새로운 칼럼을 만들고 삭제하는 경우가 많아) axis=1로 설정하고 칼럼을 드롭하는 경우가 많음

In [99]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      220.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      380.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      260.0          1

In [26]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

- Inplace=False이면 자기 자신의 DataFrame의 데이터는 삭제하지 않으며, 삭제된 결과 DataFrame을 반환. inplace=True로 설정하면 자신의 DataFrame의 데이터를 삭제
- 여러 개의 칼럼을 삭제하고 싶으면 리스트 형태로 삭제하고자 하는 칼럼명을 입력해 labels 매개변수로 입력

In [27]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
print('inplace=True로 drop후 반환된 값:', drop_result)
titanic_df.head(3)

inplace=True로 drop후 반환된 값: None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [100]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))

titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No  Age_0
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      220.0          2      0
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      380.0          2      0
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      260.0          1      0
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_by_10  Family_No  Age_0
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S      350.0          2      0
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S      350.0          1      0
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q        NaN          1      0

- 헷갈리는 거 : axis=0 은 로우(행)의 축, axis=1 은 칼럼(열)의 축. 따라서 인덱스 지울거면 axis=0 해서 행을 선택, 칼럼 지울거면 axis=1 해서 칼럼명을 선택
- **axis** : DataFrame의 로우를 삭제할 때는 axis=0, 칼럼을 삭제할 때는 axis=1으로 설정.
- 원본 DataFrame은 유지하고 드롭된 DataFrame을 새롭게 객체 변수로 받고 싶다면 inplace=False로 설정(디폴트 값이 False임). ex. titanic_drop_df = titanic_df.drop('Age_0', axis=1, inplace=False)
- 원본 DataFrame에 드롭된 결과를 적용할 경우에는 inplace=True를 적용 ex. titanic_df.drop('Age_0', axis=1, inplace=True)
- 원본 DataFrame에서 드롭된 DataFrame을 다시 원본 DataFrame 객체 변수로 할당하면 원본 DataFrame에서 드롭된 결과를 적용할 경우와 같음(단, 기존 원본 DataFrame 객체 변수는 메모리에서 추후 제거됨). ex. titanic_df = titanic_df.drop('Age_0', axis=1,inplace=False)

### Index 객체

- DataFrame, Series의 레코드를 고유하게 식별하는 객체
- + **DataFrame.index, Series.index** 속성을 통해 Index 객체만 추출
- + **DataFrame.reset_index()** : 새롭게 인덱스를 연속 숫자 형으로 할당. 기존 인덱스는 'index'라는 새로운 칼럼명으로 추가.

In [29]:
# 원본 파일 다시 로딩
titanic_df = pd.read_csv('titanic_train.csv')

# Index 객체 추출
indexes = titanic_df.index
print(indexes)

# Index 객체를 실제 값 array로 변환
print('Index 객체 array값:\n', indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index 객체 array값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [30]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

- 한번 만들어진 DataFrame 및 Series의 Index 객체는 함부로 변경할 수 없다.

In [31]:
indexes[0] = 5

TypeError: Index does not support mutable operations

- Series 객체는 Index 객체를 포함하지만 **Series 객체에 연산 함수를 적용할 때 Index는 연산에서 제외된다.**(Index는 오직 식별용으로만 사용)

In [32]:
series_fair = titanic_df['Fare']
print('Fair Series max 값:', series_fair.max())
print('Fair Series sum 값:', series_fair.sum())
print('sum() Fair Series:', sum(series_fair))
print('Fair Series + 3:\n', (series_fair+3).head(3))

Fair Series max 값: 512.3292
Fair Series sum 값: 28693.9493
sum() Fair Series: 28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [33]:
# reset_index()는 새롭게 인덱스를 연속 숫자 형으로 할당
# 기존 인덱스는 'Index'라는 새로운 칼럼명으로 추가

titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [101]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입:', type(value_counts))
new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)
print('new_value_counts 객체 변수 타입:', type(new_value_counts))

### before reset_index ###
Pclass
3    489
1    215
2    184
Name: count, dtype: int64
value_counts 객체 변수 타입: <class 'pandas.core.series.Series'>
### After reset_index ###
   Pclass  count
0       3    489
1       1    215
2       2    184
new_value_counts 객체 변수 타입: <class 'pandas.core.frame.DataFrame'>

### 데이터 셀렉션 및 필터링

- 판다스는 df의 로우나 칼럼을 지정하여 데이터를 선택할 수 있는 인덱싱의 방식으로 **iloc[ ] (위치 기반 인덱싱 방식), loc[ ] (명칭 기반 인덱싱 방식)** 제공

### DataFrame의 [ ] 연산자

- [] 연산자의 넘파이에서와 판다스에서의 차이

- + 넘파이에서 [ ] 연산자는 행의 위치, 열의 위치, 슬라이싱 범위를 지정해 데이터를 가져옴
- + 판다스에서 DataFrame 바로 뒤에 있는 [ ] 안에 들어갈 수 있는 것은 칼럼명 문자(또는 칼럼명 리스트 객체), 또는 인덱스로 변환 가능한 표현식 => **DataFrame 뒤에 있는 [ ]**는 칼럼만 지정할 수 있는 **'칼럼 지정 연산자'**로 이해

In [102]:
print('단일 칼럼 데이터 추출:\n', titanic_df['Pclass'].head(3))
print('\n여러 칼럼의 데이터 추출:\n', titanic_df[['Survived', 'Pclass']].head(3))
print('[] 안에 숫자 index는 KeyError 오류 발생:\n', titanic_df[0])

단일 칼럼 데이터 추출:
 3    1
4    3
5    3
Name: Pclass, dtype: int64

여러 칼럼의 데이터 추출:
    Survived  Pclass
3         1       1
4         0       3
5         0       3

KeyError: 0

- 판다스의 인덱스 형태로 변환 가능한 표현식은 [ ]내에 입력할 수 있다.

In [41]:
titanic_df[0:2] #슬라이싱

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [103]:
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_by_10  Family_No  Age_0
4            5         0       3  Allen, Mr. ...  male  35.0      0      0  373450   8.0500   NaN        S      350.0          1      0
5            6         0       3  Moran, Mr. ...  male   NaN      0      0  330877   8.4583   NaN        Q        NaN          1      0
7            8         0       3  Palsson, Ma...  male   2.0      3      1  349909  21.0750   NaN        S       20.0          5      0

- DataFrame 바로 뒤의 [] 연산자는 넘파이의 []나 Series의 []와 다르다.
- DataFrame 바로 뒤의 [] 내 입력값은 칼럼명(또는 칼럼의 리스트)을 지정해 칼럼 지정연산에 사용하거나 불린 인덱스 용도로만 사용해야 한다.
- DataFrame[0:2]와 같은 슬라이싱 연산으로 데이터를 추출하는 방법은 사용하지 않는 게 좋다.

### DataFrame iloc[ ] 연산자

- 위치(Location) 기반 인덱싱 방식으로 동작
- 위치 기반 인덱싱만 허용하므로 행과 열의 좌표 위치에 해당하는 값으로 **정숫값 또는 정수형의** 슬라이싱, 팬시 리스트 값을 입력해줘야 함.
- 슬라이싱, 팬시 인덱싱은 제공하나 명확한 위치 기반 인덱싱이 사용되어야 하는 제약으로 인해 불린 인덱싱 제공 X

In [44]:
data = {'Name' : ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year' : [2011, 2016, 2015, 2015],
        'Gender' : ['Male', 'Female', 'Male', 'Male']
        }
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [45]:
data_df.iloc[0,0]

'Chulmin'

In [46]:
# 아래 코드는 오류를 발생시킵니다.
data_df.iloc[0,'Name']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

- loc[]에 슬라이싱 기호를 적용하면 종료 값 -1이 아니라 종료 값까지 포함하는 것을 의미. 이는 명칭 기반 인덱싱의 특성 때문이다. 명칭은 숫자형이 아닐 수 있기 때문에 -1을 할 수가 없다.

In [47]:
# 아래 코드는 오류를 발생합니다.
data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

- iloc[ ]는 열 위치에 -1을 입력하여 DataFrame의 가장 마지막 열 데이터를 가져오는 데 자주 사용

In [105]:
# 넘파이와 마찬가지로 판다스의 인덱싱에서도 -1은 맨 마지막 값 의미

print("\n 맨 마지막 칼럼 데이터 [:,-1]\n", data_df.iloc[:,-1])
print("\n 맨 마지막 칼럼을 제외한 모든 데이터 [:,:-1]\n", data_df.iloc[:,:-1])

 맨 마지막 칼럼 데이터 [:,-1]
 one        Male
two      Female
three      Male
four       Male
Name: Gender, dtype: object

 맨 마지막 칼럼을 제외한 모든 데이터 [:,:-1]
            Name  Year
one     Chulmin  2011
two    Eunkyung  2016
three  Jinwoong  2015
four    Soobeom  2015

### DataFrame loc [ ] 연산자

- 명칭(Label) 기반으로 데이터 추출
- **loc[인덱스값, 칼럼명]**와 같은 형식으로 데이터 추출

In [49]:
data_df.loc['one', 'Name']

'Chulmin'

In [106]:
# 다음 코드는 오류를 발생시킵니다.
data_df.loc[0,'Name']

KeyError: 0

- 일반적으로 슬라이싱을 '시작값:종료값'과 같이 지정하면 시작값 ~ 종료값-1까지의 범위 의미
- loc[ ]에 슬라이싱 기호를 적용하면 종료값까지 포함 bec. 명칭 기반 인덱싱의 특성, 명칭은 숫자형이 아닐 수 있기 때문에 -1을 할 수가 없다

In [107]:
print('위치기반 iloc slicing\n', data_df.iloc[0:1,0],'\n')
print('명칭기반 loc slicing\n', data_df.loc['one':'two','Name'])

위치기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

명칭기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

### 불린 인덱싱

- 처음부터 가져올 값을 조건으로 [ ]내에 입력하면 자동으로 원하는 값을 필터링하므로 iloc나 loc보다 활용도 높음
- [ ], loc[ ]에서 지원, iloc[ ]은 정수형 값이 아닌 값에 대해 지원 X

In [52]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [53]:
titanic_df[titanic_df['Age']>60][['Name','Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [54]:
titanic_df.loc[titanic_df['Age']>60, ['Name','Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [55]:
titanic_df[(titanic_df['Age']>60)&(titanic_df['Pclass']==1)&(titanic_df['Sex']=='female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [108]:
# 개별 조건을 변수에 할당 후 결합해 불린 인덱싱 수행 가능

cond1 = titanic_df['Age']>60
cond2 = titanic_df['Pclass']==1
cond3 = titanic_df['Sex']=='female'
titanic_df[cond1&cond2&cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_by_10  Family_No  Age_0
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S      630.0          2      0
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN      620.0          1      0

### 정렬, Aggregation 함수, GroupBy 적용

#### DataFrame, Series의 정렬 - sort_values()

- DataFrame과 Series를 정렬
- + **DataFrame.sort_values()**
- 주요 입력 매개변수 : by, ascending, inplace
- + **by** : 특정 칼럼 입력시 해당 칼럼으로 정렬 수행
- + **ascending = True(default)로 설정시 오름차순 정렬**, ascending = False로 설정하면 내림차순 정렬
- + **inplace = False(default)로 설정시 sort_values()를 호출한 DF는 유지, 정렬된 DF를 결과로 반환** / inplace = True로 설정시 호출한 DF의 정렬 결과를 그대로 적용

In [57]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [110]:
# 여러 개의 칼럼으로 정렬하려면 by에 리스트 형식으로 입력
# Pclass와 Name 칼럼 기준 정렬 수행 - ascending=False 내림차순

titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked  Age_by_10  Family_No  Age_0
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S        NaN          1      0
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S      405.0          3      0
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S      160.0          1      0

### Aggregation 함수 적용

- **min(), max(), sum(), count()** 등
- DataFrame의 경우, DataFrame에서 바로 aggregation을 호출할 경우 **모든 칼럼에 해당 aggregation을 적용**

In [59]:
titanic_df.count() # 모든 칼럼의 count()결과 반환

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [111]:
titanic_df[['Age','Fare']].mean()

Age     29.703474
Fare    32.215643
dtype: float64

### groupby() 적용

- 입력 파라미터 by에 칼럼 입력시 대상 칼럼으로 groupby 된다.
- DataFrame에 groupby()를 호출하면 DataFrameGroupBy라는 또 다른 형태의 DF을 반환

In [112]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

- DF에 groupby()를 호출해 반환된 결과에 aggregation 함수를 호출하면 **groupby() 대상 칼럼을 제외**한 모든 칼럼에 해당 aggregation 함수 적용

In [113]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked  Age_by_10  Family_No  Age_0
Pclass
1               215       215   215  215  185    215    215     215   215    175       213        185        215    215
2               184       184   184  184  173    184    184     184   184     16       184        173        184    184
3               489       489   489  489  353    489    489     489   489     12       489        353        489    489

- DF의 groupby()에 특정 칼럼만 aggregation 함수를 적용하려면 groupby()로 반환된 DataFrameGroupBy() 객체에 해당 칼럼을 필터링한 뒤 함수 적용

In [65]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [66]:
titanic_df.groupby('Pclass')['Age'].agg([max,min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [114]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     89  84.214554
2       70.0     74  20.662183
3       74.0    301  13.700450

### 결손데이터 처리하기

- 결손 데이터는 칼럼에 값이 없는, 즉 NULL인 경우를 의미하며, 이를 넘파이의 NaN으로 표시

- 머신러닝 알고리즘은 NaN 값을 처리하지 않으므로 이 값을 다른 값으로 대체해야 함.

- NaN 값은 평균, 총합 등의 함수 연산 시 제외

- + **DataFrame.isna()** : NaN 여부 확인
- + **DataFrame.fillna()** : NaN 값을 다른 값으로 대체

### isna()로 결손 데이터 여부 확인

In [68]:
titanic_df.isna().head(3) # NaN인지 아닌지를 True or False로 알려줌.

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [116]:
titanic_df.isna().sum() # true = 1, false = 0이므로 이를 합하면 결손 데이터

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          685
Embarked         2
Age_by_10      177
Family_No        0
Age_0            0
dtype: int64

### filna()로 결손 데이터 대체하기

- 결손데이터를 편리하게 다른 값으로 대체할 수 있다.

In [117]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_by_10  Family_No  Age_0
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S      350.0          2      0
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500  C000        S      350.0          1      0
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583  C000        Q        NaN          1      0

- 주의 : filna()를 이용해 반환 값을 다시 받거나 inplace=True 파라미터를 fillna()에 추가해야 실제 데이터 세트 값이 변경됨

In [118]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin            0
Embarked         0
Age_by_10      177
Family_No        0
Age_0            0
dtype: int64

### apply lambda 식으로 데이터 가공

- 판다스의 경우 칼럼에 일괄적으로 데이터 가공 하는 것이 속도 면에서 더 빠르나, **복잡한 데이터 가공**이 필요할 경우 apply lambda 이용

In [72]:
def get_square(a):
    return a**2

print('3의 제곱은:', get_square(3))

3의 제곱은: 9

In [119]:
lambda_square = lambda x : x**2
print('3의 제곱은:', lambda_square(3))

3의 제곱은: 9

- **':'의 왼쪽에 있는 x는 입력 인자 / 오른쪽은 입력 인자의 계산식 => 반환 값을 의미**
- 여러 개의 값을 입력 인자로 사용해야 할 경우 보통 **map()** 함수를 결합해서 사용

In [74]:
a = [1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [75]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

In [120]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

          Age Child_Adult
3   35.000000       Adult
4   35.000000       Adult
5   29.703474       Adult
6   54.000000       Adult
7    2.000000       Child
8   27.000000       Adult
9   14.000000       Child
10   4.000000       Child

- **lambda x : '반환 값 1' if 조건문 else '반환 값 2'**

- if, else만 지원, if, else if, else와 같이 else if는 지원 X
- else if 이용 시 else 절을 ()로 내포후 () 내에서 다시 if else 적용

In [77]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Age_cat
Adult      786
Child       83
Elderly     22
Name: count, dtype: int64

In [78]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성.

def get_category(age):
    cat = ''
    if age <=5: cat = 'Baby'
    elif age <=12: cat = 'Child'
    elif age <=18: cat = 'Teenager'
    elif age <=25: cat = 'Student'
    elif age <=35: cat = 'Young Adult'
    elif age <=60: cat = 'Adult'
    else : cat = 'Elderly'
        
    return cat

# lambda 식에 위에서 생성한 get_category() 함수를 반환값으로 지정.
# get_category(X)는 입력값으로 'Age' 칼럼 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult